class/4nov_plate/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4e-8;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 4e-8;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 4e-8;
    }

    plate
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    center
    {
        type            symmetry;
    }
    
    wall
    {
      type	freestream;
      freestreamValue	uniform 4e-8;
    }
  
}

// ************************************************************************* //
